#### ViewDisplaySketchyLines Members

---

|  |
| --- |
| ViewDisplaySketchyLines Class   Methods   Properties   See Also |

The  ViewDisplaySketchyLines  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ViewDisplaySketchyLines |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | EnableSketchyLines | True to enable sketchy lines visibility. False to disable it. |
| Public property | Extension | The extension scale value. Controls the magnitude of line's extension. Values between 0 and 10. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Jitter | The jitter defines jitteriness of the line. Values between 0 and 10. |

# See Also

ViewDisplaySketchyLines Class

Autodesk.Revit.DB Namespace